<a href="https://colab.research.google.com/github/sumathi-s-vishwakarma/Pandas-Work2/blob/master/pandas2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [16]:
import pandas as pd
import numpy as np

In [17]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.815266 -0.944524  0.302378 -0.019416
2013-01-02 -1.356398  0.432477  0.509368  1.236898
2013-01-03  0.984537  0.783737  0.192600  0.928558
2013-01-04 -1.171428 -2.513436  1.802631  0.833991
2013-01-05  1.660148 -0.384962 -0.475850  0.446819
2013-01-06 -1.309129 -0.174878  0.100600 -0.961681

In [19]:
df['A']

2013-01-01   -0.815266
2013-01-02   -1.356398
2013-01-03    0.984537
2013-01-04   -1.171428
2013-01-05    1.660148
2013-01-06   -1.309129
Freq: D, Name: A, dtype: float64

In [20]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.815266 -0.944524  0.302378 -0.019416
2013-01-02 -1.356398  0.432477  0.509368  1.236898
2013-01-03  0.984537  0.783737  0.192600  0.928558

In [21]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.356398  0.432477  0.509368  1.236898
2013-01-03  0.984537  0.783737  0.192600  0.928558
2013-01-04 -1.171428 -2.513436  1.802631  0.833991

In [22]:
df.loc[dates[0]]

A   -0.815266
B   -0.944524
C    0.302378
D   -0.019416
Name: 2013-01-01 00:00:00, dtype: float64

In [23]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.815266 -0.944524
2013-01-02 -1.356398  0.432477
2013-01-03  0.984537  0.783737
2013-01-04 -1.171428 -2.513436
2013-01-05  1.660148 -0.384962
2013-01-06 -1.309129 -0.174878

In [24]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -1.356398  0.432477
2013-01-03  0.984537  0.783737
2013-01-04 -1.171428 -2.513436

In [25]:
df.iloc[3]

A   -1.171428
B   -2.513436
C    1.802631
D    0.833991
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.171428 -2.513436
2013-01-05  1.660148 -0.384962

In [27]:
 df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -1.356398  0.509368
2013-01-03  0.984537  0.192600
2013-01-05  1.660148 -0.475850

In [28]:
df[df['A'] > 0]

                   A         B        C         D
2013-01-03  0.984537  0.783737  0.19260  0.928558
2013-01-05  1.660148 -0.384962 -0.47585  0.446819

In [29]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.302378       NaN
2013-01-02       NaN  0.432477  0.509368  1.236898
2013-01-03  0.984537  0.783737  0.192600  0.928558
2013-01-04       NaN       NaN  1.802631  0.833991
2013-01-05  1.660148       NaN       NaN  0.446819
2013-01-06       NaN       NaN  0.100600       NaN